In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [150]:
import tabula
from tabula import read_pdf
import numpy as np
import pandas as pd
import re as regex
df = read_pdf('1088887.pdf', guess=False, stream=True, pages='all', multiple_tables=True,  pandas_options={'header':None})

In [151]:
pd.set_option('display.max_colwidth', -1)  #Veo hasta la Ãºltima palabra
pd.set_option('display.max_rows', 1000)

In [152]:
df[8] = df[8].drop(0, axis=1)

In [153]:
df[0] = df[0].drop(df[0].head(14).index, axis=0)
df[0] = df[0].reset_index(drop=True)

In [154]:
df = [x.dropna(axis=1, how='all') for x in df]
for df_aux in df:
    df_aux.columns = np.arange(0, len(df_aux.columns), 1)

In [155]:
df[5].loc[5, 0] = '4/7/2017 ARS Travel to and from and attend trial readiness conference in San Diego 1.80 585.00'

In [156]:
lista_head_drop = []
for dfs in df[1:]:
    dfs.loc[:, 0] = dfs.loc[:, 0].apply(str)
    filtery = [True if regex.search(r'\d{1,2}/\d{1,2}/\d{4}', x) else False for x in dfs.loc[:, 0]]
    # finding first True value 
    # USA GENERADORES
    # using next() and enumerate() 
    pos = next((i for i, j in enumerate(filtery) if j), None) 
    lista_head_drop.append(pos)
    dfs.loc[:, 0] = dfs.loc[:, 0].replace('nan', np.NaN)

In [157]:
for i, dfs in enumerate(df[1:], start=1):
    df[i] = df[i].drop(df[i].head(lista_head_drop[i-1]).index, axis=0)

In [158]:
df = [x.drop(x.tail(2).index, axis=0) for x in df]

In [159]:
df[3].loc[9, 1] = 'Prepare for, travel to and from, and take deposition of Expert Richard 8.50 4,250.00'
df[3].loc[9, 0] = 'RMW'
df[3].loc[19, 1] = 'Review, analyze and annotate trial exhibits 3.50 1,750.00'
df[3].loc[19, 0] = '4/4/2017 RMW'
filtery = [True if not pd.isna(x) else False for x in df[4].loc[:, 1]]
df[4].loc[filtery, 0] = df[4].loc[filtery, 0] + ' ' + df[4].loc[filtery, 1]
df[4].loc[filtery, 1] = np.NaN
df[10].loc[29, 1] = 'Review and analyze trial docs'
df[10].loc[29, 0] = '8/29/2017 RMW'
df[10].loc[31, 1] = 'Outline trial'
df[10].loc[31, 0] = 'RMW'
df[10].loc[33, 1] = 'Review damages'
df[10].loc[33, 0] = 'RMW'
df[10].loc[35, 1] = 'Draft, review and revise opening statement'
df[10].loc[35, 0] = 'RMW'
df[11].loc[4, 1] = 'Review deposition( s) for trial 2.90 1,450.00'
df[11].loc[4, 0] = '8/30/2017 RMW'

In [160]:
df = [x.dropna(axis=1, how='all') for x in df]
for df_aux in df:
    df_aux.columns = np.arange(0, len(df_aux.columns), 1)

In [161]:
df[12] = df[12].loc[4:16, :]

In [162]:
df[12].loc[15, 0] = '5/7/2018 LBS'

C:\Users\brian\Anaconda3\lib\site-packages\pandas\core\indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)
C:\Users\brian\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [163]:
df[0].loc[13, 1] = '175.00/hr'

In [164]:
df[6].loc[:, 1] = df[6].loc[:, 1].str.replace('i', '/')

In [169]:
df[9].loc[15, 1] = '325.00/hr'

In [173]:
df[2].loc[16, 1] = '325.00/hr'

In [183]:
df[5].loc[16, 0] = 'Deposition of Plaintiffs Expert Barbara Luna (4-17-i7) 175.00/hr'

In [165]:
for i in range(len(df)):
    print(i)
    df[i].head(2)

0

                                            0            1
0  3/3/2017 RMW Receive and review RO summary  0.30 150.00
1  NaN                                         500.00/hr

1

                                                                                                     0
6  3/14/2017 EJ Draft email from Kristi Livedalen (NP) regarding expert depositions and 0.10 NO CHARGE
7  vehicle inspection scheduling 175.00/hr

2

,0,1
5,3/21/2017 EJ,"Draft, prepare, and serve Plaintiff's Objections to Notice of Deposition 0.30 52.50"
6,NaN,of Plaintiff (3-23-17) 175.00/hr

3

,0,1
5,3/31/2017 EJ,Email serve Lisa Tudzin (NP) documents to be produced at deposition 0.10 NO CHARGE
6,NaN,of Darrell Blasjo (4-5-17) 175.00/hr

4

,0,1
7,4/4/2017 EJ Review email from Lisa Tudzin (NP) regarding status of vehicle for,0.10 NO CHARGE
8,inspection,175.00/hr

5

                                                                                                0
5  4/7/2017 ARS Travel to and from and attend trial readiness conference in San Diego 1.80 585.00
6  325.00/hr

6

,0,1
7,"4/19/2017 EJ Prepare, file, and serve Plaintiffs Opposition to Defendants' Motions in",0.20 35.00
8,Limine #1,175.00/hr

7

,0,1
7,"4/20/2017 ARS Draft, review and revise trial brief regarding affirmative duty special jury",1.00 325.00
8,instruction,325.00/hr

8

                                        0           1
8  5/16/2017 ARS Review email from client  0.10 32.50
9  NaN                                     325.00/hr

9

               0                                                           1
4  6/28/2017 ARS  Review and revise joint jury instruction draft 0.50 162.50
5  NaN            325.00/hr

10

              0                     1           2
5  8/1/2017 ARS  Phone call to client  0.10 32.50
6  NaN           NaN                   325.00/hr

11

               0                                              1
4  8/30/2017 RMW  Review deposition( s) for trial 2.90 1,450.00
5  NaN            500.00/hr

12

,0,1
4,10/11/2017 RE,Telephone conference with Phillip Reznik regarding Barbara Luna's 0.20 35.00
5,NaN,declaration 175.00/hr

In [166]:
%run ./FUNCIONES.ipynb

In [184]:
df_aux = []
rpr = [
    [1,1,1,2,2,2,2,3,2,2],
    [2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1],
    [2,2,2,2,2,1,2,2,2,2,2,2,2,2,1,1],
    [2,1,2,2,2,2,2,1,2,2,2,2,2,2,2,2],
    [2,2,2,1,1,1,1,2,1,1,1,1,2,2,1,1],
    [1,1,2,1,2,2,1,2,1,2,2,2,1,1,2,1],
    [2,2,1,1,1,1,1,2,2,2,2,2,2,2,2,2],
    [2,1,1,2,1,2,2,2,1,1,1,1,2,1,1,1],
    [1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1],
    [1,1,2,1,1,1,1,1,1,1,1,1,2,1,2,2],
    [1,1,1,2,1,2,1,1,1,1,1,1,1,1,1,1],
    [1,6,1,1,1,1,1,1,3,5,2,2,2],
    [2,3,2,2,1,1]    
]
for i, dfs in enumerate(df):
    if len(dfs.columns) == 1:
        print(i, '0')
        df_aux.append(dndhrt(dfs, rpr[i]))
    elif len(dfs.columns) == 2:
        print(i, '0 1')
        if i >= 9 or i==2 or i==3:
            df_aux.append(dn_dhrt(dfs, rpr[i]))
        else:
            df_aux.append(dnd_hrt(dfs, rpr[i]))
    elif len(dfs.columns) == 3:
        print(i, '0 1 2')
        df_aux.append(dn_d_hrt(dfs, rpr[i]))

0 0 1
1 0
2 0 1
3 0 1
4 0 1
5 0
6 0 1
7 0 1
8 0 1
9 0 1
10 0 1 2
11 0 1
12 0 1

In [186]:
DF = pd.concat(df_aux)

In [187]:
DF.shape

(149, 6)

In [188]:
DF.to_excel(r"C:\Users\brian\Desktop\trabajillo\\1088887.xlsx", index=False)